ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/gclk.h
#define GCLK_GENCTRL_ID_Pos _UINT32_(0) /* (GCLK_GENCTRL) Generic Clock Generator Selection Position */
#define GCLK_GENCTRL_ID_Msk                                                                                            \
        (_UINT32_(0xF) << GCLK_GENCTRL_ID_Pos) /* (GCLK_GENCTRL) Generic Clock Generator Selection Mask */
#define GCLK_GENCTRL_ID(value)                                                                                         \
        (GCLK_GENCTRL_ID_Msk &                                                                                         \
         (_UINT32_(value) << GCLK_GENCTRL_ID_Pos)) /* Assigment of value for ID in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_SRC_Pos _UINT32_(8) /* (GCLK_GENCTRL) Source Select Position */
#define GCLK_GENCTRL_SRC_Msk (_UINT32_(0x1F) << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) Source Select Mask */
#define GCLK_GENCTRL_SRC(value)                                                                                        \
        (GCLK_GENCTRL_SRC_Msk &                                                                                        \
         (_UINT32_(value) << GCLK_GENCTRL_SRC_Pos)) /* Assigment of value for SRC in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_SRC_XOSC_Val _UINT32_(0x0) /* (GCLK_GENCTRL) XOSC oscillator output  */
#define GCLK_GENCTRL_SRC_GCLKIN_Val _UINT32_(0x1) /* (GCLK_GENCTRL) Generator input pad  */
#define GCLK_GENCTRL_SRC_GCLKGEN1_Val _UINT32_(0x2) /* (GCLK_GENCTRL) Generic clock generator 1 output  */
#define GCLK_GENCTRL_SRC_OSCULP32K_Val _UINT32_(0x3) /* (GCLK_GENCTRL) OSCULP32K oscillator output  */
#define GCLK_GENCTRL_SRC_OSC32K_Val _UINT32_(0x4) /* (GCLK_GENCTRL) OSC32K oscillator output  */
#define GCLK_GENCTRL_SRC_XOSC32K_Val _UINT32_(0x5) /* (GCLK_GENCTRL) XOSC32K oscillator output  */
#define GCLK_GENCTRL_SRC_OSC8M_Val _UINT32_(0x6) /* (GCLK_GENCTRL) OSC8M oscillator output  */
#define GCLK_GENCTRL_SRC_DFLL48M_Val _UINT32_(0x7) /* (GCLK_GENCTRL) DFLL48M output  */
#define GCLK_GENCTRL_SRC_DPLL96M_Val _UINT32_(0x8) /* (GCLK_GENCTRL) DPLL96M output  */
#define GCLK_GENCTRL_SRC_XOSC                                                                                          \
        (GCLK_GENCTRL_SRC_XOSC_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) XOSC oscillator output Position  */
#define GCLK_GENCTRL_SRC_GCLKIN                                                                                        \
        (GCLK_GENCTRL_SRC_GCLKIN_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) Generator input pad Position  */
#define GCLK_GENCTRL_SRC_GCLKGEN1                                                                                      \
        (                                                                                                              \
                GCLK_GENCTRL_SRC_GCLKGEN1_Val                                                                          \
                << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) Generic clock generator 1 output Position  */
#define GCLK_GENCTRL_SRC_OSCULP32K                                                                                     \
        (                                                                                                              \
                GCLK_GENCTRL_SRC_OSCULP32K_Val                                                                         \
                << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) OSCULP32K oscillator output Position  */
#define GCLK_GENCTRL_SRC_OSC32K                                                                                        \
        (GCLK_GENCTRL_SRC_OSC32K_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) OSC32K oscillator output Position  */
#define GCLK_GENCTRL_SRC_XOSC32K                                                                                       \
        (GCLK_GENCTRL_SRC_XOSC32K_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) XOSC32K oscillator output Position */
#define GCLK_GENCTRL_SRC_OSC8M                                                                                         \
        (GCLK_GENCTRL_SRC_OSC8M_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) OSC8M oscillator output Position  */
#define GCLK_GENCTRL_SRC_DFLL48M                                                                                       \
        (GCLK_GENCTRL_SRC_DFLL48M_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) DFLL48M output Position  */
#define GCLK_GENCTRL_SRC_DPLL96M                                                                                       \
        (GCLK_GENCTRL_SRC_DPLL96M_Val << GCLK_GENCTRL_SRC_Pos) /* (GCLK_GENCTRL) DPLL96M output Position  */
#define GCLK_GENCTRL_GENEN_Pos _UINT32_(16) /* (GCLK_GENCTRL) Generic Clock Generator Enable Position */
#define GCLK_GENCTRL_GENEN_Msk                                                                                         \
        (_UINT32_(0x1) << GCLK_GENCTRL_GENEN_Pos) /* (GCLK_GENCTRL) Generic Clock Generator Enable Mask */
#define GCLK_GENCTRL_GENEN(value)                                                                                      \
        (GCLK_GENCTRL_GENEN_Msk &                                                                                      \
         (_UINT32_(value) << GCLK_GENCTRL_GENEN_Pos)) /* Assigment of value for GENEN in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_IDC_Pos _UINT32_(17) /* (GCLK_GENCTRL) Improve Duty Cycle Position */
#define GCLK_GENCTRL_IDC_Msk (_UINT32_(0x1) << GCLK_GENCTRL_IDC_Pos) /* (GCLK_GENCTRL) Improve Duty Cycle Mask */
#define GCLK_GENCTRL_IDC(value)                                                                                        \
        (GCLK_GENCTRL_IDC_Msk &                                                                                        \
         (_UINT32_(value) << GCLK_GENCTRL_IDC_Pos)) /* Assigment of value for IDC in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_OOV_Pos _UINT32_(18) /* (GCLK_GENCTRL) Output Off Value Position */
#define GCLK_GENCTRL_OOV_Msk (_UINT32_(0x1) << GCLK_GENCTRL_OOV_Pos) /* (GCLK_GENCTRL) Output Off Value Mask */
#define GCLK_GENCTRL_OOV(value)                                                                                        \
        (GCLK_GENCTRL_OOV_Msk &                                                                                        \
         (_UINT32_(value) << GCLK_GENCTRL_OOV_Pos)) /* Assigment of value for OOV in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_OE_Pos _UINT32_(19) /* (GCLK_GENCTRL) Output Enable Position */
#define GCLK_GENCTRL_OE_Msk (_UINT32_(0x1) << GCLK_GENCTRL_OE_Pos) /* (GCLK_GENCTRL) Output Enable Mask */
#define GCLK_GENCTRL_OE(value)                                                                                         \
        (GCLK_GENCTRL_OE_Msk &                                                                                         \
         (_UINT32_(value) << GCLK_GENCTRL_OE_Pos)) /* Assigment of value for OE in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_DIVSEL_Pos _UINT32_(20) /* (GCLK_GENCTRL) Divide Selection Position */
#define GCLK_GENCTRL_DIVSEL_Msk (_UINT32_(0x1) << GCLK_GENCTRL_DIVSEL_Pos) /* (GCLK_GENCTRL) Divide Selection Mask */
#define GCLK_GENCTRL_DIVSEL(value)                                                                                     \
        (GCLK_GENCTRL_DIVSEL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << GCLK_GENCTRL_DIVSEL_Pos)) /* Assigment of value for DIVSEL in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_DIVSEL_DIV1_Val _UINT32_(0x0) /* (GCLK_GENCTRL) Divide input directly by divider factor  */
#define GCLK_GENCTRL_DIVSEL_DIV2_Val _UINT32_(0x1) /* (GCLK_GENCTRL) Divide input by 2^(divider factor+ 1)  */
#define GCLK_GENCTRL_DIVSEL_DIV1                                                                                       \
        (                                                                                                              \
                GCLK_GENCTRL_DIVSEL_DIV1_Val                                                                           \
                << GCLK_GENCTRL_DIVSEL_Pos) /* (GCLK_GENCTRL) Divide input directly by divider factor Position  */
#define GCLK_GENCTRL_DIVSEL_DIV2                                                                                       \
        (                                                                                                              \
                GCLK_GENCTRL_DIVSEL_DIV2_Val                                                                           \
                << GCLK_GENCTRL_DIVSEL_Pos) /* (GCLK_GENCTRL) Divide input by 2^(divider factor+ 1) Position  */
#define GCLK_GENCTRL_RUNSTDBY_Pos _UINT32_(21) /* (GCLK_GENCTRL) Run in Standby Position */
#define GCLK_GENCTRL_RUNSTDBY_Msk (_UINT32_(0x1) << GCLK_GENCTRL_RUNSTDBY_Pos) /* (GCLK_GENCTRL) Run in Standby Mask   \
                                                                                */
#define GCLK_GENCTRL_RUNSTDBY(value)                                                                                   \
        (GCLK_GENCTRL_RUNSTDBY_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << GCLK_GENCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the GCLK_GENCTRL register */
#define GCLK_GENCTRL_Msk _UINT32_(0x003F1F0F) /* (GCLK_GENCTRL) Register Mask  */


