ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/gclk.h
/* -------- GCLK_GENDIV : (GCLK Offset: 0x08) (R/W 32) Generic Clock Generator Division -------- */
#define GCLK_GENDIV_RESETVALUE _UINT32_(0x00) /*  (GCLK_GENDIV) Generic Clock Generator Division  Reset Value */

#define GCLK_GENDIV_ID_Pos _UINT32_(0) /* (GCLK_GENDIV) Generic Clock Generator Selection Position */
#define GCLK_GENDIV_ID_Msk                                                                                             \
        (_UINT32_(0xF) << GCLK_GENDIV_ID_Pos) /* (GCLK_GENDIV) Generic Clock Generator Selection Mask */
#define GCLK_GENDIV_ID(value)                                                                                          \
        (GCLK_GENDIV_ID_Msk &                                                                                          \
         (_UINT32_(value) << GCLK_GENDIV_ID_Pos)) /* Assigment of value for ID in the GCLK_GENDIV register */
#define GCLK_GENDIV_DIV_Pos _UINT32_(8) /* (GCLK_GENDIV) Division Factor Position */
#define GCLK_GENDIV_DIV_Msk (_UINT32_(0xFFFF) << GCLK_GENDIV_DIV_Pos) /* (GCLK_GENDIV) Division Factor Mask */
#define GCLK_GENDIV_DIV(value)                                                                                         \
        (GCLK_GENDIV_DIV_Msk &                                                                                         \
         (_UINT32_(value) << GCLK_GENDIV_DIV_Pos)) /* Assigment of value for DIV in the GCLK_GENDIV register */
#define GCLK_GENDIV_Msk _UINT32_(0x00FFFF0F) /* (GCLK_GENDIV) Register Mask  */


/** \brief GCLK register offsets definitions */
#define GCLK_CTRL_REG_OFST _UINT32_(0x00) /* (GCLK_CTRL) Control Offset */
#define GCLK_STATUS_REG_OFST _UINT32_(0x01) /* (GCLK_STATUS) Status Offset */
#define GCLK_CLKCTRL_REG_OFST _UINT32_(0x02) /* (GCLK_CLKCTRL) Generic Clock Control Offset */
#define GCLK_GENCTRL_REG_OFST _UINT32_(0x04) /* (GCLK_GENCTRL) Generic Clock Generator Control Offset */
#define GCLK_GENDIV_REG_OFST _UINT32_(0x08) /* (GCLK_GENDIV) Generic Clock Generator Division Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GCLK register API structure */
typedef struct { /* Generic Clock Generator */
        __IO uint8_t GCLK_CTRL; /**< Offset: 0x00 (R/W  8) Control */
        __I uint8_t GCLK_STATUS; /**< Offset: 0x01 (R/   8) Status */
        __IO uint16_t GCLK_CLKCTRL; /**< Offset: 0x02 (R/W  16) Generic Clock Control */
        __IO uint32_t GCLK_GENCTRL; /**< Offset: 0x04 (R/W  32) Generic Clock Generator Control */
        __IO uint32_t GCLK_GENDIV; /**< Offset: 0x08 (R/W  32) Generic Clock Generator Division */
} gclk_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_GCLK_COMPONENT_H_ */
